def permutation(i,n,r):

    if i == r:

        print(p)
    
    else:

        for j in range(n):

            if used[j] == 0:

                used[j] = 1

                p[i] = a[j]

                permutation(i+1,n,r)

                used[j] = 0


n = 5
r = 3

a = [i for i in range(1,n+1)]

p = [0]*r
used = [0] * n

"""
##앞자리가 1인 순열

p[0] = 1 #0번을 1로 고정하고
used[0] = 1 #0번 원소인 1은 사용했다

permutation(1,n,r) #1번자리부터 결정하도록
[1, 2, 3]
[1, 2, 4]
[1, 2, 5]
[1, 3, 2]
[1, 3, 4]
[1, 3, 5]
[1, 4, 2]
[1, 4, 3]
[1, 4, 5]
[1, 5, 2]
[1, 5, 3]
[1, 5, 4]
"""

"""
##앞자리가 2인 순열

p[0] = 2
used[1] = 1 ##1번 원소인 2를 사용했다

permutation(1,n,r)
[2, 1, 3]
[2, 1, 4]
[2, 1, 5]
[2, 3, 1]
[2, 3, 4]
[2, 3, 5]
[2, 4, 1]
[2, 4, 3]
[2, 4, 5]
[2, 5, 1]
[2, 5, 3]
[2, 5, 4]
"""
